lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
								switch(TYPE_OF_SENSOR){
									case POWER_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_POWER;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_POWER;

										aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_CP_RECEIVED_EVT;
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case TRAINER:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_POWER;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_POWER;

										aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_CP_RECEIVED_EVT;
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case CSC_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CSC_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;

										aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_CSC_RECEIVED_EVT;
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case SHIMANO_SENSOR:
									{

										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_SHIMANO;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_SHIMANO;

										aP2PClientContext[index].sensor_evt_type = P2P_NOTIFICATION_SHIMANO_RECEIVED_EVT;
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
								}

                            }
                        }
                    }
                    break;//ok

                case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_READ_BY_TYPE_RESP */

                    /* USER CODE END EVT_BLUE_ATT_READ_BY_TYPE_RESP */
                    aci_att_read_by_type_resp_event_rp0 *pr = (void*)blue_evt->data;

                    uint8_t idx;
                    uint16_t uuid, handle;

                    /* the event data will be
                     * 2 bytes start handle
                     * 1 byte char properties
                     * 2 bytes handle
                     * 2 or 16 bytes data
                     */

                    uint8_t index;

                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (aP2PClientContext[index].connHandle != pr->Connection_Handle))
                        index++;

                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {

                        /* we are interested in only 16 bit UUIDs */
                        if (uuid_format_char == 1){idx=17;}
                        else if (uuid_format_char==0){idx=5;}

                        if(pr->Handle_Value_Pair_Length == 21 || pr->Handle_Value_Pair_Length == 7)

                        {

                        	pr->Data_Length -= 1;
                            while(pr->Data_Length > 0)
                            {
                                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx]);
                                /* store the characteristic handle not the attribute handle */

                                if(uuid_format_char==1){handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);}
                                else if(uuid_format_char==0){handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-2]);}

                                if(uuid == CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID)
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	  APP_DBG_MSG("-- GATT : SENSOR_NOTIFY_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
                                    aP2PClientContext[index].P2PNotificationCharHdle = handle;
                                    aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
                                }
                                if(uuid == SHIMANO_CHAR_UUID){
#if(CFG_DEBUG_APP_TRACE != 0)
                                	  APP_DBG_MSG("-- GATT : SENSOR_NOTIFY_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
                                	aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
                                    aP2PClientContext[index].P2PNotificationCharHdle = handle;

                                }
                                else if (uuid == CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID)
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	APP_DBG_MSG("-- GATT : SENSOR_READ_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif

                                	aP2PClientContext[index].state = APP_BLE_READ_CHARACS;
									aP2PClientContext[index].P2PReadCharHdle = handle;
									aP2PClientContext[index].P2PcurrentCharBeingRead = CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID;

                                }

                                if(uuid == CYCLING_POWER_MEASUREMENT_CHAR_UUID)
								{
#if(CFG_DEBUG_APP_TRACE != 0)
									  APP_DBG_MSG("-- GATT : POWER_NOTIFY_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
									aP2PClientContext[index].P2PNotificationCharHdle = handle;
									aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
								}

                                if(uuid_format_char==1){
                                    pr->Data_Length -= 21;
                                    idx += 21;
                                }
                                else if (uuid_format_char==0){
                                    pr->Data_Length -= 7;;
                                    idx += 7;;
                                }


